tutorials/multiform/resolvedSimulations/reactivePacking/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./system/domainsize"

convertToMeters $scalegrid;

vertices
(
    ($x1 $y1 -0.01)
    ($x2 $y1 -0.01)
    ($x2 $y2 -0.01)
    ($x1 $y2 -0.01)
    ($x1 $y1 0.01)
    ($x2 $y1 0.01)
    ($x2 $y2 0.01)
    ($x1 $y2 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xgrid $ygrid 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    symmup
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    symmdown
    {
        type symmetryPlane;
        faces
	(
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type        empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
