tutorials/multiform/resolvedSimulations/reactivePacking/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          GAMG;
        smoother        DILU;
        tolerance       1e-10;
        relTol          0;
    }

    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }

}

SIMPLE
{

    #include    "residualControl"

    nNonOrthogonalCorrectors 5;
    pRefCell        0;
    pRefValue       0;

}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.6;
        T               1;
    }
}




// ************************************************************************* //
