tutorials/multiform/resolvedSimulations/reactivePacking/system/domainsize
scalegrid 1.911228;
x1 0.000000;
y1 0.000000;
z1 0.000000;
xin 0.500000;
yin 0.010000;
zin 0.000000;
x2 10.000000;
y2 1.000000;
z2 1.000000;
xgrid 1000;
ygrid 100;
zgrid 100;
snap true;
#inputMode merge